###################################################################

# Created by write_sdc on Thu Feb  6 13:41:40 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {toIRAM[31]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[30]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[29]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[28]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[27]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[26]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[25]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[24]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[23]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[22]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[21]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[20]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[19]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[18]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[17]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[16]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[15]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[14]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[13]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[12]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[11]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[10]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[9]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[8]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[7]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[6]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[5]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[4]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[3]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[2]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[1]}]
set_load -pin_load 3.40189 [get_ports {toIRAM[0]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[31]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[30]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[29]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[28]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[27]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[26]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[25]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[24]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[23]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[22]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[21]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[20]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[19]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[18]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[17]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[16]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[15]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[14]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[13]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[12]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[11]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[10]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[9]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[8]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[7]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[6]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[5]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[4]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[3]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[2]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[1]}]
set_load -pin_load 3.40189 [get_ports {toDRAMaddress[0]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[31]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[30]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[29]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[28]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[27]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[26]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[25]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[24]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[23]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[22]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[21]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[20]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[19]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[18]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[17]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[16]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[15]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[14]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[13]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[12]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[11]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[10]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[9]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[8]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[7]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[6]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[5]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[4]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[3]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[2]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[1]}]
set_load -pin_load 3.40189 [get_ports {toDRAMdata[0]}]
set_load -pin_load 3.40189 [get_ports toDRAMenable]
set_load -pin_load 3.40189 [get_ports toDRAMrw]
set_load -pin_load 3.40189 [get_ports {toDRAMfunct3[2]}]
set_load -pin_load 3.40189 [get_ports {toDRAMfunct3[1]}]
set_load -pin_load 3.40189 [get_ports {toDRAMfunct3[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 3  -waveform {0 1.5}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromIRAM[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {fromDRAM[0]}]
